# Lab02
Sreyrath Poeun
02/17/2023

In [1]:
#set up
import numpy as np
import pandas as pd
import datetime as datetime

In [2]:
#import data and make 1st col into an index
kc=pd.read_csv("https://raw.githubusercontent.com/aaiken1/fin-data-analysis-python/main/data/kc_house_data.csv"
                ,index_col=0, parse_dates=True)
kc.index

Int64Index([7129300520, 6414100192, 5631500400, 2487200875, 1954400510,
            7237550310, 1321400060, 2008000270, 2414600126, 3793500160,
            ...
            7852140040, 9834201367, 3448900210, 7936000429, 2997800021,
             263000018, 6600060120, 1523300141,  291310100, 1523300157],
           dtype='int64', name='id', length=21613)

In [3]:
#get rid of extra variables in "date"
kc['date'] = kc['date'].str.replace('T000000','')
kc.head()

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
id,,,,,,,,,,,,,,,,,,,,
7129300520,20141013,221900.0,3,1.00,1180,5650,1.0,0,0,3,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
6414100192,20141209,538000.0,3,2.25,2570,7242,2.0,0,0,3,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
5631500400,20150225,180000.0,2,1.00,770,10000,1.0,0,0,3,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
2487200875,20141209,604000.0,4,3.00,1960,5000,1.0,0,0,5,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
1954400510,20150218,510000.0,3,2.00,1680,8080,1.0,0,0,3,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

In [4]:
#change "date" to date format
kc['date'] = pd.to_datetime(kc['date'], format='%Y-%m-%d')

In [5]:
#Use "shape" to give the number of rows and columns in the DataFrame.
kc.shape

#() function or method

(21613, 20)

In [6]:
#Use "columns" to show our variables.
kc.columns

Index(['date', 'price', 'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot',
       'floors', 'waterfront', 'view', 'condition', 'grade', 'sqft_above',
       'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode', 'lat', 'long',
       'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [7]:
#Use describe() to get summary statistics for all of the columns
kc.describe()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
count,2.161300e+04,21613.000000,21613.000000,21613.000000,2.161300e+04,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000
mean,5.400881e+05,3.370842,2.114757,2079.899736,1.510697e+04,1.494309,0.007542,0.234303,3.409430,7.656873,1788.390691,291.509045,1971.005136,84.402258,98077.939805,47.560053,-122.213896,1986.552492,12768.455652
std,3.671272e+05,0.930062,0.770163,918.440897,4.142051e+04,0.539989,0.086517,0.766318,0.650743,1.175459,828.090978,442.575043,29.373411,401.679240,53.505026,0.138564,0.140828,685.391304,27304.179631
min,7.500000e+04,0.000000,0.000000,290.000000,5.200000e+02,1.000000,0.000000,0.000000,1.000000,1.000000,290.000000,0.000000,1900.000000,0.000000,98001.000000,47.155900,-122.519000,399.000000,651.000000
25%,3.219500e+05,3.000000,1.750000,1427.000000,5.040000e+03,1.000000,0.000000,0.000000,3.000000,7.000000,1190.000000,0.000000,1951.000000,0.000000,98033.000000,47.471000,-122.328000,1490.000000,5100.000000
50%,4.500000e+05,3.000000,2.250000,1910.000000,7.618000e+03,1.500000,0.000000,0.000000,3.000000,7.000000,1560.000000,0.000000,1975.000000,0.000000,98065.000000,47.571800,-122.230000,1840.000000,7620.000000
75%,6.450000e+05,4.000000,2.500000,2550.000000,1.068800e+04,2.000000,0.000000,0.000000,4.000000,8.000000,2210.000000,560.000000,1997.000000,0.000000,98118.000000,47.678000,-122.125000,2360.000000,10083.000000
max,7.700000e+06,33.000000,8.000000,13540.000000,1.651359e+06,3.500000,1.000000,4.000000,5.000000,13.000000,9410.000000,4820.000000,2015.000000,2015.000000,98199.000000,47.777600,-121.315000,6210.000000,871200.000000

In [8]:
#Use describe() to get summary statistics for just price, bedrooms, bathrooms, and sqft_living.
kc[['price','bedrooms','bathrooms','sqft_living']].describe()

              price      bedrooms     bathrooms   sqft_living
count  2.161300e+04  21613.000000  21613.000000  21613.000000
mean   5.400881e+05      3.370842      2.114757   2079.899736
std    3.671272e+05      0.930062      0.770163    918.440897
min    7.500000e+04      0.000000      0.000000    290.000000
25%    3.219500e+05      3.000000      1.750000   1427.000000
50%    4.500000e+05      3.000000      2.250000   1910.000000
75%    6.450000e+05      4.000000      2.500000   2550.000000
max    7.700000e+06     33.000000      8.000000  13540.000000

In [9]:
#Add the code below and re-run your last describe()
pd.options.display.float_format = '{:,.2f}'.format

In [10]:
#Rerun the code above
kc[['price','bedrooms','bathrooms','sqft_living']].describe()

             price  bedrooms  bathrooms  sqft_living
count    21,613.00 21,613.00  21,613.00    21,613.00
mean    540,088.14      3.37       2.11     2,079.90
std     367,127.20      0.93       0.77       918.44
min      75,000.00      0.00       0.00       290.00
25%     321,950.00      3.00       1.75     1,427.00
50%     450,000.00      3.00       2.25     1,910.00
75%     645,000.00      4.00       2.50     2,550.00
max   7,700,000.00     33.00       8.00    13,540.00

In [33]:
#Use min() and max() to print the min and max date in the data set
kc['date'].agg([min, max])

min   2014-05-02
max   2015-05-27
Name: date, dtype: datetime64[ns]

In [12]:
#create new datetime
kc['ym'] = kc['date'].dt.strftime('%Y-%m')

In [15]:
#create group
ym_group=kc.groupby('ym')

In [17]:
#find mean price per group
ym_group['price'].mean()

ym
2014-05   548,080.28
2014-06   558,002.20
2014-07   544,788.76
2014-08   536,445.28
2014-09   529,253.82
2014-10   539,026.97
2014-11   521,961.01
2014-12   524,461.87
2015-01   525,870.89
2015-02   507,851.37
2015-03   543,977.19
2015-04   561,837.77
2015-05   558,126.81
Name: price, dtype: float64

In [31]:
#Use groupby() to find the mean of price by ym
kc.groupby('ym')['price'].mean()

ym
2014-05   548,080.28
2014-06   558,002.20
2014-07   544,788.76
2014-08   536,445.28
2014-09   529,253.82
2014-10   539,026.97
2014-11   521,961.01
2014-12   524,461.87
2015-01   525,870.89
2015-02   507,851.37
2015-03   543,977.19
2015-04   561,837.77
2015-05   558,126.81
Name: price, dtype: float64

In [34]:
#Use groupby() and agg() to find the mean, median, and standard deviation of price by ym.
kc.groupby('ym')['price'].agg([np.mean,np.median,np.std])

#mean, median, std are in np, so much use np in front

              mean     median        std
ym
2014-05 548,080.28 465,000.00 356,502.79
2014-06 558,002.20 465,000.00 388,260.13
2014-07 544,788.76 465,000.00 346,731.12
2014-08 536,445.28 442,100.00 370,583.43
2014-09 529,253.82 450,000.00 372,531.67
2014-10 539,026.97 446,900.00 399,243.06
2014-11 521,961.01 435,000.00 355,710.23
2014-12 524,461.87 432,500.00 353,292.72
2015-01 525,870.89 438,500.00 366,053.60
2015-02 507,851.37 425,545.00 325,998.28
2015-03 543,977.19 450,000.00 355,051.20
2015-04 561,837.77 476,500.00 369,928.88
2015-05 558,126.81 455,000.00 414,821.96

In [35]:
pd.options.display.float_format = '${:,.0f}'.format

In [36]:
kc.groupby('ym')['price'].agg([np.mean,np.median,np.std])

            mean   median      std
ym
2014-05 $548,080 $465,000 $356,503
2014-06 $558,002 $465,000 $388,260
2014-07 $544,789 $465,000 $346,731
2014-08 $536,445 $442,100 $370,583
2014-09 $529,254 $450,000 $372,532
2014-10 $539,027 $446,900 $399,243
2014-11 $521,961 $435,000 $355,710
2014-12 $524,462 $432,500 $353,293
2015-01 $525,871 $438,500 $366,054
2015-02 $507,851 $425,545 $325,998
2015-03 $543,977 $450,000 $355,051
2015-04 $561,838 $476,500 $369,929
2015-05 $558,127 $455,000 $414,822

In [37]:
pd.options.display.float_format = '{:.2f}'.format